ghsecuritylab/ArmFirmware/bsp/stm32f40x/applications/application.c
/*
 * File      : application.c
 * This file is part of RT-Thread RTOS
 * COPYRIGHT (C) 2006, RT-Thread Development Team
 *
 * The license and distribution terms for this file may be
 * found in the file LICENSE in this distribution or at
 * http://www.rt-thread.org/license/LICENSE
 *
 * Change Logs:
 * Date           Author       Notes
 * 2009-01-05     Bernard      the first version
 * 2014-04-27     Bernard      make code cleanup. 
 */

#include <board.h>
#include <rtthread.h>

#ifdef RT_USING_LWIP
#include <lwip/sys.h>
#include <lwip/api.h>
#include <netif/ethernetif.h>
#include "stm32f4xx_eth.h"
#endif

#ifdef RT_USING_GDB
#include <gdb_stub.h>
#endif



////
//user define
////


#include "exti.h"
#include "stm32f4_rtc.h"
#include "rtc.h"
#include "time.h"
#include "gl823k.h"
#include "key_scan.h"
#include "usart4.h"
#include "adc.h"
#include "cmd_process.h"
int th_displayerApp_init()
{
	rt_thread_t tid;

    tid = rt_thread_create("displayer",
        th_ScreenProcessFunc, RT_NULL,
        1024, RT_THREAD_PRIORITY_MAX/3, 10);

    if (tid != RT_NULL)
        rt_thread_startup(tid);

    return 0;
}
int th_readADApp_init()
{
		rt_thread_t tid;

    tid = rt_thread_create("readAD",
        th_readADFunc, RT_NULL,
        512, 10, 1);

    if (tid != RT_NULL)
        rt_thread_startup(tid);

    return 0;
}
void rt_init_thread_entry(void* parameter)
{
    /* GDB STUB */
#ifdef RT_USING_GDB
    gdb_set_device("uart6");
    gdb_start();
#endif
		
    /* LwIP Initialization */
#ifdef RT_USING_LWIP
    {
        extern void lwip_sys_init(void);

        /* register ethernetif device */
        eth_system_device_init();

        rt_hw_stm32_eth_init();

        /* init lwip system */
        lwip_sys_init();
        rt_kprintf("TCP/IP initialized!\n");
    }
#endif
				
		//rt_hw_rtc_init();		
	//	exti_initialize();
th_readADApp_init();
	th_displayerApp_init();
//	key_scan_init();
}

int rt_application_init()
{
    rt_thread_t tid;

    tid = rt_thread_create("init",
        rt_init_thread_entry, RT_NULL,
        2048, RT_THREAD_PRIORITY_MAX/3, 20);

    if (tid != RT_NULL)
        rt_thread_startup(tid);

    return 0;
}

/*@}*/
